validation_cases/workshop2/vortex/constant/parameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      parameters;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
r1    0.5;
r2    #calc "2.0*$r1";
outr  #calc "17.0*$r1";
r1m   #calc "$r1 * cos(degToRad(45.0))";
r2m   #calc "$r2 * cos(degToRad(45.0))";
zb    -0.1;
zf    0.1;

len   0.1;
cyl   #calc "int(($r2-$r1) / $len * 2)";
rec   #calc "int(($outr-$r2) / $len)";
ext   #calc "int($rec*0.5)";

xr1   #calc "$r1 * cos(degToRad(22.5))";
yr1   #calc "$r1 * sin(degToRad(22.5))";
xr2   #calc "$r2 * cos(degToRad(22.5))";
yr2   #calc "$r2 * sin(degToRad(22.5))";

initK         3.75e-5;
initEpsilon   4.134e-8;
initOmega     0.0123;
